Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70Q21B.atdf
        <register caption="Device Global Interrupt Mask Register" name="USBHS_DEVIMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Suspend Interrupt Mask" mask="0x00000001" name="SUSPE"/>
          <bitfield caption="Micro Start of Frame Interrupt Mask" mask="0x00000002" name="MSOFE"/>
          <bitfield caption="Start of Frame Interrupt Mask" mask="0x00000004" name="SOFE"/>
          <bitfield caption="End of Reset Interrupt Mask" mask="0x00000008" name="EORSTE"/>
          <bitfield caption="Wake-Up Interrupt Mask" mask="0x00000010" name="WAKEUPE"/>
          <bitfield caption="End of Resume Interrupt Mask" mask="0x00000020" name="EORSME"/>
          <bitfield caption="Upstream Resume Interrupt Mask" mask="0x00000040" name="UPRSME"/>
          <bitfield caption="Endpoint 0 Interrupt Mask" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Mask" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Mask" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Mask" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Mask" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Mask" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Mask" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Mask" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Mask" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Mask" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="Endpoint 10 Interrupt Mask" mask="0x00400000" name="PEP_10"/>
          <bitfield caption="Endpoint 11 Interrupt Mask" mask="0x00800000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt Mask" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Mask" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Mask" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Mask" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Mask" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Mask" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Mask" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Device Global Interrupt Disable Register" name="USBHS_DEVIDR" offset="0x0014" rw="W" size="4" atomic-op="clear:USBHS_DEVIMR">
          <bitfield caption="Suspend Interrupt Disable" mask="0x00000001" name="SUSPEC"/>
          <bitfield caption="Micro Start of Frame Interrupt Disable" mask="0x00000002" name="MSOFEC"/>
          <bitfield caption="Start of Frame Interrupt Disable" mask="0x00000004" name="SOFEC"/>
          <bitfield caption="End of Reset Interrupt Disable" mask="0x00000008" name="EORSTEC"/>
          <bitfield caption="Wake-Up Interrupt Disable" mask="0x00000010" name="WAKEUPEC"/>
          <bitfield caption="End of Resume Interrupt Disable" mask="0x00000020" name="EORSMEC"/>
          <bitfield caption="Upstream Resume Interrupt Disable" mask="0x00000040" name="UPRSMEC"/>
          <bitfield caption="Endpoint 0 Interrupt Disable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Disable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Disable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Disable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Disable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Disable" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Disable" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Disable" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Disable" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Disable" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="Endpoint 10 Interrupt Disable" mask="0x00400000" name="PEP_10"/>
          <bitfield caption="Endpoint 11 Interrupt Disable" mask="0x00800000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt Disable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Disable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Disable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Disable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Disable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Disable" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Disable" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Device Global Interrupt Enable Register" name="USBHS_DEVIER" offset="0x0018" rw="W" size="4" atomic-op="set:USBHS_DEVIMR">
          <bitfield caption="Suspend Interrupt Enable" mask="0x00000001" name="SUSPES"/>
          <bitfield caption="Micro Start of Frame Interrupt Enable" mask="0x00000002" name="MSOFES"/>
          <bitfield caption="Start of Frame Interrupt Enable" mask="0x00000004" name="SOFES"/>
          <bitfield caption="End of Reset Interrupt Enable" mask="0x00000008" name="EORSTES"/>
          <bitfield caption="Wake-Up Interrupt Enable" mask="0x00000010" name="WAKEUPES"/>
          <bitfield caption="End of Resume Interrupt Enable" mask="0x00000020" name="EORSMES"/>
          <bitfield caption="Upstream Resume Interrupt Enable" mask="0x00000040" name="UPRSMES"/>
          <bitfield caption="Endpoint 0 Interrupt Enable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Enable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Enable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Enable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Enable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Enable" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Enable" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Enable" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Enable" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Enable" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="Endpoint 10 Interrupt Enable" mask="0x00400000" name="PEP_10"/>
          <bitfield caption="Endpoint 11 Interrupt Enable" mask="0x00800000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Enable" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Device Endpoint Register" name="USBHS_DEVEPT" offset="0x001C" rw="RW" size="4">
          <bitfield caption="Endpoint 0 Enable" mask="0x00000001" name="EPEN0"/>
          <bitfield caption="Endpoint 1 Enable" mask="0x00000002" name="EPEN1"/>
          <bitfield caption="Endpoint 2 Enable" mask="0x00000004" name="EPEN2"/>
          <bitfield caption="Endpoint 3 Enable" mask="0x00000008" name="EPEN3"/>
          <bitfield caption="Endpoint 4 Enable" mask="0x00000010" name="EPEN4"/>
          <bitfield caption="Endpoint 5 Enable" mask="0x00000020" name="EPEN5"/>
          <bitfield caption="Endpoint 6 Enable" mask="0x00000040" name="EPEN6"/>
          <bitfield caption="Endpoint 7 Enable" mask="0x00000080" name="EPEN7"/>
          <bitfield caption="Endpoint 8 Enable" mask="0x00000100" name="EPEN8"/>
          <bitfield caption="Endpoint 9 Enable" mask="0x00000200" name="EPEN9"/>
          <bitfield caption="Endpoint 0 Reset" mask="0x00010000" name="EPRST0"/>
          <bitfield caption="Endpoint 1 Reset" mask="0x00020000" name="EPRST1"/>
          <bitfield caption="Endpoint 2 Reset" mask="0x00040000" name="EPRST2"/>
          <bitfield caption="Endpoint 3 Reset" mask="0x00080000" name="EPRST3"/>
          <bitfield caption="Endpoint 4 Reset" mask="0x00100000" name="EPRST4"/>
          <bitfield caption="Endpoint 5 Reset" mask="0x00200000" name="EPRST5"/>
          <bitfield caption="Endpoint 6 Reset" mask="0x00400000" name="EPRST6"/>
          <bitfield caption="Endpoint 7 Reset" mask="0x00800000" name="EPRST7"/>
          <bitfield caption="Endpoint 8 Reset" mask="0x01000000" name="EPRST8"/>
          <bitfield caption="Endpoint 9 Reset" mask="0x02000000" name="EPRST9"/>
        </register>
